create table groups
(
    id bigserial constraint group_pk primary key,
    title text
);

create table amount_units
(
    id bigserial constraint amount_units_pk primary key,
    title text
);

create table types
(
    id bigserial constraint type_form_pk primary key,
    title text not null
);

create table medicines
(
    id bigserial constraint medicines_pk primary key,
    title text not null,
    amount integer,
    type_id integer constraint type_fk references types,
    amount_unit_id integer constraint amount_unit_fk references amount_units,
    group_id integer constraint group_fk references groups
);

INSERT INTO groups (title) VALUES ('ЖКТ'),
                                  ('Кишечник'),
                                  ('Снотворное'),
                                  ('Витамины'),
                                  ('Мозг'),
                                  ('Суставы'),
                                  ('Сорбент'),
                                  ('Дерматит'),
                                  ('Успокаивающее'),
                                  ('Анальгетик'),
                                  ('Слабительное'),
                                  ('Гипертония'),
                                  ('Прочее'),
                                  ('Кашель'),
                                  ('Головокружение'),
                                  ('Антигистаминное'),
                                  ('Противомикробное'),
                                  ('Противофиброзное'),
                                  ('Кошачье'),
                                  ('Антибиотик'),
                                  ('Желчегонное'),
                                  ('Противодиарейное'),
                                  ('Антисептик'),
                                  ('Жаропонижающее');

INSERT INTO types (title) VALUES ('Таблетки'),
                                        ('Капсулы'),
                                        ('Раствор для инъекций'),
                                        ('Мазь'),
                                        ('Гель'),
                                        ('Раствор'),
                                        ('Капли'),
                                        ('Прочее'),
                                        ('Порошок для суспензий'),
                                        ('Суппозиторий'),
                                        ('Клей');


INSERT INTO amount_units (title) VALUES ('шт'),
                                        ('г'),
                                        ('мг'),
                                        ('мкг'),
                                        ('л'),
                                        ('мл'),
                                        ('мкл');

INSERT INTO medicines (title, amount, type_id, amount_unit_id,group_id) VALUES ('Нексиум', 8, 1, 1, 1),
                                                                      ('D-GAZ', 8, 2, 1, 2),
                                                                      ('Донормил', 30, 1, 1, 3),
                                                                      ('Магний B6', 100, 1, 1, 4),
                                                                      ('Магне B6', 60, 1, 1, 4),
                                                                      ('Периндоприл', 12, 1, 1, 5),
                                                                      ('Нейромидин', 28, 1, 1, 5),
                                                                      ('Аркоксиа', 2, 1, 1, 6),
                                                                      ('Активированный уголь', 4, 2, 1, 7),
                                                                      ('Ракстан', 21, 1, 1, 6),
                                                                      ('Этоксидол', 10, 1, 1, 5),
                                                                      ('Цитофлавин', 20, 1, 1, 5),
                                                                      ('Тизанил', 30, 1, 1, 5),
                                                                      ('Мидокальм', 15, 1, 1, 5),
                                                                      ('Тридерм', 15, 4, 2, 8),
                                                                      ('Сустамол', 50, 5, 6, 6),
                                                                      ('Персен', 15, 1, 1, 9),
                                                                      ('Верошпирон', 10, 2, 1, 10),
                                                                      ('Бисакодил', 26, 1, 1, 11),
                                                                      ('Телмиста', 21, 1, 1, 12),
                                                                      ('Вальсакор', 13, 1, 1, 12),
                                                                      ('Пикамилон', 0, 1, 1, 5),
                                                                      ('Мексиприм', 0, 1, 1, 5),
                                                                      ('Кавинтон', 0, 1, 1, 5),
                                                                      ('Тералиджен', 0, 1, 1, 9),
                                                                      ('Афобазол 10мг', 0, 1, 1, 9),
                                                                      ('Закофальк', 17, 1, 2, 2),
                                                                      ('Белый актив', 20, 1, 1, 7),
                                                                      ('Аскорбиновая кислота', 10, 1, 2, 4),
                                                                      ('Уголь биоактивированный', 20, 1, 1, 7),
                                                                      ('Слабилен', 19, 1, 1, 11),
                                                                      ('Аскорутин', 25, 1, 1, 4),
                                                                      ('Пластырь', 15, 8, 1, 13),
                                                                      ('Бинт', 1, 8, 1, 13),
                                                                      ('Хлоргексидин', 4, 6, 1, 23),
                                                                      ('АЕвитамины', 30, 2, 1, 4),
                                                                      ('Эспумизан', 15, 2, 1, 2),
                                                                      ('Квамател', 26, 1, 1, 1),
                                                                      ('Никотиновая кислота', 8, 3, 1, 4),
                                                                      ('Элеутерококк', 30, 1, 1, 4),
                                                                      ('Звездочка', 3, 4, 1, 13),
                                                                      ('Пипетка', 2, 8, 1, 13),
                                                                      ('Флуифорт', 4, 9, 1, 14),
                                                                      ('Бетасерк', 18, 1, 1, 15),
                                                                      ('Лакто и бифидобактерии LBB', 10, 2, 1, 2),
                                                                      ('Ренгалин', 18, 1, 1, 14),
                                                                      ('Супрастин', 20, 1, 1, 16),
                                                                      ('Таблетки от кашля', 6, 1, 1, 14),
                                                                      ('Лефлобакт', 6, 1, 1, 17),
                                                                      ('Термопсол', 25, 1, 1, 14),
                                                                      ('Лонгидаза', 10, 10, 1, 18),
                                                                      ('Калия Перманганат', 5, 8, 2, 13),
                                                                      ('БФ-6', 15, 11, 2, 13),
                                                                      ('Ацетилсалициловая кислота', 20, 1, 1, 24),
                                                                      ('Микролакс', 4, 6, 1, 11),
                                                                      ('Пентальгин', 13, 1, 1, 10),
                                                                      ('Анальгин', 30, 1, 1, 10),
                                                                      ('Ареал', 20, 1, 1, 10),
                                                                      ('Фурацилин', 36, 1, 1, 23),
                                                                      ('Нимесулид', 9, 1, 1, 10),
                                                                      ('Успокоин', 2, 1, 1, 19),
                                                                      ('Флемоксин 1000 мг', 20, 1, 1, 20),
                                                                      ('Хофитол', 15, 1, 1, 21),
                                                                      ('Лоперамид', 18, 2, 1, 22),
                                                                      ('Кетонал Дуо', 26, 2, 1, 10),
                                                                      ('Комболипен', 25, 1, 1, 4),
                                                                      ('Капотен', 7, 1, 1, 12);