create table amount_units
(
    id bigserial constraint amount_units_pk primary key,
    title text
);

create table types
(
    id bigserial constraint type_form_pk primary key,
    title text not null
);

create table medicines
(
    id bigserial constraint medicines_pk primary key,
    title text not null,
    amount integer,
    type_id integer constraint type_fk references types,
    amount_unit_id integer constraint amount_unit_fk references amount_units
);

-- INSERT INTO types (title) VALUES ('Таблетки'),
--                                  ('Капсулы'),
--                                  ('Раствор для инъекций'),
--                                  ('Мазь'),
--                                  ('Гель'),
--                                  ('Раствор'),
--                                  ('Капли'),
--                                  ('Прочее');

INSERT INTO types (title) VALUES ('Таблетки'),
                                        ('Капсулы'),
                                        ('Раствор для инъекций'),
                                        ('Мазь'),
                                        ('Гель'),
                                        ('Раствор'),
                                        ('Капли'),
                                        ('Прочее'),
                                        ('Порошок для суспензий'),
                                        ('Суппозиторий'),
                                        ('Клей');


INSERT INTO amount_units (title) VALUES ('шт'),
                                        ('г'),
                                        ('мг'),
                                        ('мкг'),
                                        ('л'),
                                        ('мл'),
                                        ('мкл');

-- INSERT INTO medicines (title, amount, type_id, amount_unit_id) VALUES ('Анальгин 500 мг', 20, 1, 1),
--                                                                       ('Лоперамид 2мг', 10, 2, 1),
--                                                                       ('Кетонал 50 мг/мл', 5, 3, 1),
--                                                                       ('Гидрокортизон 1%', 10, 4, 2),
--                                                                       ('Вольтарен 2%', 100, 5, 2),
--                                                                       ('Рингера', 400, 6, 6),
--                                                                       ('Отривин 0.1%', 10, 7, 6),
--                                                                       ('Бинт стерильный 10 см', 1, 8, 1);

INSERT INTO medicines (title, amount, type_id, amount_unit_id) VALUES ('ЖКТ - Нексиум', 8, 1, 1),
                                                                      ('Кишечник - D-GAZ', 8, 2, 1),
                                                                      ('Снотворное - Донормил', 30, 1, 1),
                                                                      ('Витамины - Магний B6', 100, 1, 1),
                                                                      ('Витамины - Магне B6', 60, 1, 1),
                                                                      ('Мозг - Периндоприл', 12, 1, 1),
                                                                      ('Мозг - Нейромидин', 28, 1, 1),
                                                                      ('Суставы - Аркоксиа', 2, 1, 1),
                                                                      ('Сорбент - Активированный уголь', 4, 2, 1),
                                                                      ('Суставы - Ракстан', 21, 1, 1),
                                                                      ('Мозг - Этоксидол', 10, 1, 1),
                                                                      ('Мозг - Цитофлавин', 20, 1, 1),
                                                                      ('Мозг - Тизанил', 30, 1, 1),
                                                                      ('Мозг - Мидокальм', 15, 1, 1),
                                                                      ('Дерматит - Тридерм', 15, 4, 2),
                                                                      ('Суставы - Сустамол', 50, 5, 6),
                                                                      ('Успокаивающее - Персен', 15, 1, 1),
                                                                      ('Анальгетик - Верошпирон', 10, 2, 1),
                                                                      ('Слабительное - Бисакодил', 26, 1, 1),
                                                                      ('Гипертония - Телмиста', 21, 1, 1),
                                                                      ('Гипертония - Вальсакор', 13, 1, 1),
                                                                      ('Мозг - Пикамилон', 0, 1, 1),
                                                                      ('Мозг - Мексиприм', 0, 1, 1),
                                                                      ('Мозг - Кавинтон', 0, 1, 1),
                                                                      ('Успокоительное - Тералиджен', 0, 1, 1),
                                                                      ('Успокаивающее - Афобазол 10мг', 0, 1, 1),
                                                                      ('Кишечник - Закофальк', 17, 1, 2),
                                                                      ('Сорбент - Белый актив', 20, 1, 1),
                                                                      ('Витамины - Аскорбиновая кислота', 10, 1, 2),
                                                                      ('Сорбент - Уголь биоактивированный', 20, 1, 1),
                                                                      ('Слабительное - Слабилен', 19, 1, 1),
                                                                      ('Витамины - Аскорутин', 25, 1, 1),
                                                                      ('Пластырь', 15, 8, 1),
                                                                      ('Бинт', 1, 8, 1),
                                                                      ('Антисептик - Хлоргексидин', 4, 6, 1),
                                                                      ('Витамины - АЕвитамины', 30, 2, 1),
                                                                      ('Кишечник - Эспумизан', 15, 2, 1),
                                                                      ('ЖКТ - Квамател', 26, 1, 1),
                                                                      ('Витамины - никотиновая кислота', 8, 3, 1),
                                                                      ('Витамины - Элеутерококк', 30, 1, 1),
                                                                      ('Звездочка', 3, 4, 1),
                                                                      ('Пипетка', 2, 8, 1),
                                                                      ('Кашель - Флуифорт', 4, 9, 1),
                                                                      ('Головокружение - Бетасерк', 18, 1, 1),
                                                                      ('Кишечник - Лакто и бифидобактерии LBB', 10, 2, 1),
                                                                      ('Кашель - Ренгалин', 18, 1, 1),
                                                                      ('Антигистаминное - Супрастин', 20, 1, 1),
                                                                      ('Кашель - Таблетки от кашля', 6, 1, 1),
                                                                      ('Противомикробное - Лефлобакт', 6, 1, 1),
                                                                      ('Кашель - Термопсол', 25, 1, 1),
                                                                      ('Противофиброзное - Лонгидаза', 10, 10, 1),
                                                                      ('Калия Перманганат', 5, 8, 2),
                                                                      ('БФ-6', 15, 11, 2),
                                                                      ('Жаропонижающее - Ацетилсалициловая кислота', 20, 1, 1),
                                                                      ('Слабительное - Микролакс', 4, 6, 1),
                                                                      ('Анальгетик - Пентальгин', 13, 1, 1),
                                                                      ('Анальгетик - Анальгин', 30, 1, 1),
                                                                      ('Анальгетик - Ареал', 20, 1, 1),
                                                                      ('Антисептик - Фурацилин', 36, 1, 1),
                                                                      ('Анальгетик - Нимесулид', 9, 1, 1),
                                                                      ('Кошачье - Успокоин', 2, 1, 1),
                                                                      ('Антибиотик - Флемоксин 1000 мг', 20, 1, 1),
                                                                      ('Желчегонный - Хофитол', 15, 1, 1),
                                                                      ('Противодиарейное - Лоперамид', 18, 2, 1),
                                                                      ('Анальгетик - Кетонал Душ', 26, 2, 1),
                                                                      ('Витамины - Комболипен', 25, 1, 1),
                                                                      ('Гипертония - Капотен', 7, 1, 1);